<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [6]:
import pandas as pd
import psycopg2

In [8]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select
            count(*)
            from public.vacancies
            group by id
'''

In [5]:
df = pd.read_sql_query(query_3_1, connection)
df 
# Ответ - 49197

       count
0          1
1          1
2          1
3          1
4          1
...      ...
49192      1
49193      1
49194      1
49195      1
49196      1

[49197 rows x 1 columns]

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
query_3_2 = f'''select
            count(*)
            from public.employers
            group by id
'''

In [7]:
df_emp = pd.read_sql_query(query_3_2, connection)
df_emp
# Ответ - 23500

       count
0          1
1          1
2          1
3          1
4          1
...      ...
23496      1
23497      1
23498      1
23499      1
23500      1

[23501 rows x 1 columns]

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
query_3_3 = f'''select
            count(*)
            from public.areas
            group by id
'''

In [9]:
df_areas= pd.read_sql_query(query_3_3, connection)
df_areas 
# Ответ - 1362

      count
0         1
1         1
2         1
3         1
4         1
...     ...
1357      1
1358      1
1359      1
1360      1
1361      1

[1362 rows x 1 columns]

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
query_3_4 = f'''select
            count(*)
            from public.industries
            group by id
'''

In [11]:
df_industries= pd.read_sql_query(query_3_4, connection)
df_industries 
# Ответ - 294

     count
0        1
1        1
2        1
3        1
4        1
..     ...
289      1
290      1
291      1
292      1
293      1

[294 rows x 1 columns]

***

#### Выводы по предварительному анализу данных:
     Обращая внимания на количество подсчитанных данных, могу сделать следующие выводы: 
     1. Рынок IT еще не насышен, судя по количеству вакансии и работадателям.
     2. Поиск квалифицированных кандидатов является сложной задачей. Об этом говорит нам количество регионов, задействованых при поике кандидатов. 
     3. Количетво разнообразия вакансии говорит о том, что в этой сфере необходимы кандидаты с разными умениями и навыками, подтверждая то, что рынок IT ненасыщен и развивается. 

     Это предварителные выводы, основанные на первом знакомстве. Они могут быть и ошибочными. Чтобы разобраться во всем, необходимо "копать" глубже, 
     чем я и займусь.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [12]:
query_4_1 = f'''select
            a.name,
            count(v.id) cnt
            from public.vacancies v 
            join public.areas a on v.area_id = a.id
            group by a.name
            order by count(v.id) desc
'''

In [13]:
df_cnt= pd.read_sql_query(query_4_1, connection)
df_cnt
#Ответ - Москва, Санкт-Петербург, Минск, Новосибирск, Алматы

                name   cnt
0             Москва  5333
1    Санкт-Петербург  2851
2              Минск  2112
3        Новосибирск  2006
4             Алматы  1892
..               ...   ...
764       Тарко-Сале     1
765    Новоаннинский     1
766            Бирск     1
767           Сасово     1
768             Анна     1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [14]:
query_4_2 = f'''select
            v.id,
            count(v.id) cnt
            from public.vacancies v 
            where salary_to is not null
            or salary_from is not null
            group by v.id
            
'''

In [15]:
df_cnt_vac= pd.read_sql_query(query_4_2, connection)
df_cnt_vac 
#ответ - 24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [ ]:
query_4_3 = f'''select
            avg(v.salary_from) lower_edge,
            avg(v.salary_to) upper_edge
            from public.vacancies v      
'''

In [ ]:
df_avg= pd.read_sql_query(query_4_3, connection)
df_avg

     lower_edge     upper_edge
0  71064.657901  110536.741923

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
query_4_4 = f'''select
            count(*),
            v.employment,
            v.schedule 
            from public.vacancies v    
            group by v.employment, v.schedule
            order by count(*) desc
            
'''

In [ ]:
df_vac= pd.read_sql_query(query_4_4, connection)
df_vac

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
query_4_5 = f'''select
            count(*),
            v.experience
            from public.vacancies v    
            group by v.experience
            order by count(*) asc
            
'''

In [ ]:
df_exp= pd.read_sql_query(query_4_5, connection)
df_exp

   count          experience
0   1337         Более 6 лет
1   7197           Нет опыта
2  14511       От 3 до 6 лет
3  26152  От 1 года до 3 лет

***

#### Выводы по детальному анализу:
        В принципе, предварительный анализ был близок к более детальному анализу. Но есть некоторые корректировки.
        1.Количество регионов большое, но вакансии по ним распределены неравномерно. Чем больше регион, тем больше предложении о работе.
        2.Удивительный тренд для специалистов, на втором месте по занятости, является полный рабочий день - удалено. Это говорит о том, что 
        местоположение сотрудника не так важно. Главное - быть хорошим спецом. 
        3.Средная вилка по зп впечатляющая. Это также подтверждает, что it сфера востребовательна. 
        4.О насыщенности рынка можно судить о том, что многие работодатели готовы нанять специалиста без опыта работы.
        Без опыта работы - (14%) от общего количества вакансий. Достаточно много. 

        В общем рынку нужны спеиалисты разного уровня знаний в it - сфереб и при этом работадатели готовы платить хорошие деньги. 
        Соблазнительный рынок труда.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [6]:
query_5_1 = f'''select
            e.name employer,
            count(v.id)
            from public.employers e
            join public.vacancies v on v.employer_id = e.id  
            group by e.name
            order by count(v.id) desc
        
'''

In [7]:
df_num_vac= pd.read_sql_query(query_5_1, connection)
df_num_vac

                     employer  count
0                      Яндекс   1933
1                  Ростелеком    491
2                    Тинькофф    444
3                        СБЕР    428
4               Газпром нефть    331
...                       ...    ...
14761            им. Тьюринга      1
14762        LLC Novalab Tech      1
14763   Компания Мир упаковки      1
14764  Лифинцев Олег Иванович      1
14765      ТрансЭнергоХолдинг      1

[14766 rows x 2 columns]

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [8]:
query_5_2 = f'''select
            a.name Area,
            count(e.id) employers,
            count(v.id) vacancies
            from public.areas a
            left join public.employers e on a.id = e.area
            left join public.vacancies v on a.id = v.area_id
            where v.id is null
            group by a.id
            order by 2 desc
        
'''

In [9]:
df_num_vacanc= pd.read_sql_query(query_5_2, connection)
df_num_vacanc

                   area  employers  vacancies
0                Россия        410          0
1             Казахстан        207          0
2    Московская область         75          0
3    Краснодарский край         19          0
4    Ростовская область         18          0
..                  ...        ...        ...
588             Скидель          0          0
589          Белоозерск          0          0
590           Орловский          0          0
591          Павловская          0          0
592             Таксимо          0          0

[593 rows x 3 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [6]:
query_5_3 = f'''select
            e.name employer,
            count(distinct v.area_id) areas
            from public.employers e
            left join public.vacancies v on e.id = v.employer_id  
            group by e.id
            order by 2 desc
'''

In [7]:
df_num_vacanc= pd.read_sql_query(query_5_3, connection)
df_num_vacanc

                     employer  areas
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
23496              Но Смокинг      0
23497        МАСТЕРСКАЯ CREED      0
23498           Dzing Finance      0
23499                    КОРС      0
23500             Наука-Связь      0

[23501 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [8]:
query_5_4 = f'''select
                count(e.id) 
                from employers e
                left join employers_industries i on e.id=i.employer_id
                where industry_id is null       
            
'''

In [9]:
df_num_i= pd.read_sql_query(query_5_4, connection)
df_num_i

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [13]:
query_5_5 = f'''select
                e.name employers,
                count(i.industry_id) sphere
                from public.employers e
                left join employers_industries i on e.id=i.employer_id
                group by employers
                having count(i.industry_id) = 4
                order by 1  
                Offset 2
                Limit 1       
            
'''

In [14]:
df_camp= pd.read_sql_query(query_5_5, connection)
df_camp

  employers  sphere
0      2ГИС       4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [22]:
query_5_6 = f'''select
                count(e.id) AS employers_count
                from employers e
                join employers_industries ei ON e.id = ei.employer_id
                join industries i ON ei.industry_id = i.id
                where i.name = 'Разработка программного обеспечения'
            '''

In [23]:
df_emp_cnt= pd.read_sql_query(query_5_6, connection)
df_emp_cnt

   employers_count
0             3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [ ]:
table = pd.read_html("https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8")
df = table[1]
cities = tuple(df['Город'])
cities

In [78]:
query_5_7 = f'''select
             
                a.name mil_city, count(v.id)
                from vacancies v
                left join employers e on e.id=v.employer_id
                left join areas a on v.area_id= a.id
                where a.name in {cities}
                and e.name ='Яндекс'
                group by a.name 
                
                
                union all
                
                select 
                'total', count(*)
                from vacancies v
                left join employers e on e.id=v.employer_id
                left join areas a on v.area_id= a.id
                where a.name in {cities}
                and e.name ='Яндекс'
            
            order by 2 asc
'''

In [79]:
df_q= pd.read_sql_query(query_5_7, connection)
df_q

           mil_city  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4             Пермь     25
5            Казань     25
6    Ростов-на-Дону     25
7               Уфа     26
8            Самара     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16            total    485

***

 #### Выводы по анализу работодателей
        1.В сфере айти преобладают своего рода гиганты такое как Яндекс, Тинькофф, Росстелеком, у которых много вакансии и в разных регионах страны. 
        2.Зоны предоставления вакансии в большинстве случаев крупные города.
        3.В основном на рынке представлены частные кампании, гос сектор малопредставлен.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [10]:
query_6_1 = f'''select count(*)
                from vacancies
                where lower(name) like '%data%' or lower(name) like '%данн%'
                or upper(name) like '%data%' or upper(name) like '%данн%'
            '''

In [ ]:
df_total_ds= pd.read_sql_query(query_6_1, connection)
df_total_ds

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [25]:
query_6_2 = f'''select count(*)
                from vacancies
                where 
                (name ilike '%data scientist%'
                OR name ilike '%data science%'
                OR name ilike '%исследователь данных%'
                OR name ilike '%machine learning%'
                OR name ilike '%машинн%обучен%'
                OR (name ilike '%ml%' AND name not ilike '%html%'))
                AND  (
                    name ilike '%junior%'
                    OR experience ilike '%%нет опыта%'
                    OR employment ilike '%cтражировка%'
                )
            '''

In [28]:
df_junior_position_ds= pd.read_sql_query(query_6_2, connection)
df_total_ds
#ответ 51

   count
0     49

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [43]:
query_6_3 = f'''select count(*)
                from vacancies
                WHERE 
                (name ilike '%data scientist%'
                OR name ilike '%data science%'
                OR name ilike '%исследователь данных%'
                OR name ilike '%machine learning%'
                OR name ilike '%машинн%обучен%'
                OR (name LIKE '%ML%' AND name not ilike '%html%'))
                AND key_skills IS NOT NULL
                AND
                (key_skills ILIKE '%sql%' 
                OR key_skills ILIKE '%postgres%')
            '''

In [44]:
df_ds_sql= pd.read_sql_query(query_6_3, connection)
df_ds_sql

   count
0    201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [48]:
query_6_4 = f'''select count(*)
                from vacancies
                WHERE 
                (name ilike '%data scientist%'
                OR name ilike '%data science%'
                OR name ilike '%исследователь данных%'
                OR name ilike '%machine learning%'
                OR name ilike '%машинн%обучен%'
                OR (name LIKE '%ML%' AND name not ilike '%html%'))
                AND key_skills ILIKE '%python%' 
               
            '''

In [49]:
df_ds_python= pd.read_sql_query(query_6_4, connection)
df_ds_python

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [66]:
query_6_5 = f'''select
                AVG(LENGTH(key_skills) - LENGTH(REPLACE(key_skills, CHR(9), ''))+1) AS avg_skills_count
                from vacancies
                WHERE 
                (name ilike '%data scientist%'
                OR name ilike '%data science%'
                OR name ilike '%исследователь данных%'
                OR name ilike '%machine learning%'
                OR name ilike '%машинн%обучен%'
                OR (name LIKE '%ML%' AND name not ilike '%html%'))
                AND key_skills is not null 
            '''

In [67]:
df_ds_avg_skills = pd.read_sql_query(query_6_5, connection)
df_ds_avg_skills

   avg_skills_count
0          6.406032

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [69]:
query_6_6 = f'''select
                experience, ROUND(AVG(coalesce((salary_from + salary_to) / 2, salary_from, salary_to)), 0) AS average_salary
                from vacancies
                WHERE 
                (name ilike '%data scientist%'
                OR name ilike '%data science%'
                OR name ilike '%исследователь данных%'
                OR name ilike '%machine learning%'
                OR name ilike '%машинн%обучен%'
                OR (name LIKE '%ML%' AND name not ilike '%html%'))
                AND experience ILIKE '%от 3 до 6 лет%'
                AND (salary_from IS NOT NULL OR salary_to IS NOT NULL)
                GROUP BY experience
            '''

In [ ]:
df_ds_avg_salary = pd.read_sql_query(query_6_6, connection)
df_ds_avg_salary

***

#### Выводы по предметному анализу
    1.Соотношение количества вакансии, связанных с анализо данных  не так велико. Из 49000 вакансии только 1770. 
    Надо уточнить за какой год эти данные. Я думаю, что спрос еще вырастит в будущем. Об этом можно судить по
    средним зарплатам. За пофессиональные навыки, работодаели готовы платить хорошие зп.
    2. Для получения такой зарплаты, необходимо будет попотеть. Потому как специалист должен обладатьв среднем около 6 скилами. То есть, человеку нужно будет попотеть, чтобы освоить эту профессию. ( порог входа в профессию высок)

# Общий вывод по проекту
    Судя по проведенному анадизу данных, можно с уверенностью констатировать, что рынок IT динамичено развивается.
    Работодателям "охотяться" за специалисты разных направлений и экспертности. Много вакансии, которые готовы брать так сказать "новобранцев", начинающие свой путь в технологической сфере. Это говорит нам о спросе.
    Технологии развиваются очень быстро, а мир вокруг нас еще быстрее. Поэтому работодатели готовы брать джунов, чтобы
    воспитать специалиста "под себя", для нужд своего проекта. 
    Вилка по зарплатам выше средней по стране, что также привлекает молодых люей к сфере IT. Хотя самые "лакомые" вакансии находятся в городах- миллионниках, фирмы предоставляют возможность работать удалено. Человек может работать дома, никуда не переезжая, и при этом, зарабатывать хорошие деньги. 
    Подводя итог вышесказанному, могу сказать, что эта одна из немногих сфер, где наблюдается баланс между спросом и желающими работать в этом направлении (созданы благоприятные условия труда).